Pandas Practices

In [2]:
%pip install pandas

Requirement already satisfied: pandas in c:\users\hp\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.23.2 in c:\users\hp\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas) (2.2.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\hp\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\hp\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\hp\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in c:\users\hp\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 25.0.1
[notice] To update, run: C:\Users\HP\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.11_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

In [3]:
import pandas as pd

In [4]:
df=pd.read_csv('data.csv')

In [5]:
df

             Name Designation Gender    Age     Salary
0         Mukhtar   Professor      M   37.0   115000.0
1           Azziz     Teacher      M   30.0    35000.0
2          Mohsin    Engineer      M   29.0    50000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
4           Babar    Engineer      F   25.0  1500000.0
5            Aqsa   Scientist      F   22.0        NaN
6           Rafia     Analyst      F   29.0    20000.0
7           Samra   Scientist      F   26.0   115000.0
8            Eman    Engineer      F   28.0    35000.0
9        Abdullah     Teacher      M   55.0        NaN
10          Mosib   professor      M   60.0    70000.0
11          Ahmed    engineer      M    NaN    90000.0
12          Ahsan     trainer      M  156.0   110000.0
13          Wajid     teacher      M   67.0     2000.0
14          Naeem     trainer      M   80.0    16000.0
15         Qaisar   professor      M   20.0   170000.0
16          Wajid    Engineer      M   85.0   190000.0

Make Series

In [7]:
s=pd.Series([1,2,3,4,5])

In [8]:
print(s)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [10]:
dates=pd.date_range("20250205",periods=6)
print(dates)

DatetimeIndex(['2025-02-05', '2025-02-06', '2025-02-07', '2025-02-08',
               '2025-02-09', '2025-02-10'],
              dtype='datetime64[ns]', freq='D')

In [19]:
import pandas as pd

In [11]:
data = {
    "Name": ["Ayesha Khan", "Fatima Ali", "Zainab Ahmed", "Hira Saeed", "Mariam Raza"],
    "Email": ["ayesha.khan@gmail.com", "fatima.ali@gmail.com", "zainab.ahmed@hotmail.com", "hira.saeed@gmail.com", "mariam.raza@outlook.com"],
    "Age": [22, 25, 23, 24, 26],
    "Contact No": ["0301-1234567", "0322-9876543", "0333-4567890", "0345-6789012", "0312-7890123"]
}

df = pd.DataFrame(data)

# Printing the DataFrame
print(df)

           Name                     Email  Age    Contact No
0   Ayesha Khan     ayesha.khan@gmail.com   22  0301-1234567
1    Fatima Ali      fatima.ali@gmail.com   25  0322-9876543
2  Zainab Ahmed  zainab.ahmed@hotmail.com   23  0333-4567890
3    Hira Saeed      hira.saeed@gmail.com   24  0345-6789012
4   Mariam Raza   mariam.raza@outlook.com   26  0312-7890123

In [27]:
# Another way
#df=pd.DataFrame({"Name" : ['Fatima','Zainab'], "Age" : [22,23]}) and so on

In [21]:
df.describe()

             Age
count   5.000000
mean   24.000000
std     1.581139
min    22.000000
25%    23.000000
50%    24.000000
75%    25.000000
max    26.000000

In [22]:
df.head(1)

          Name                  Email  Age    Contact No
0  Ayesha Khan  ayesha.khan@gmail.com   22  0301-1234567

In [23]:
df.tail(1)

          Name                    Email  Age    Contact No
4  Mariam Raza  mariam.raza@outlook.com   26  0312-7890123

In [24]:
df.loc[2]

Name                      Zainab Ahmed
Email         zainab.ahmed@hotmail.com
Age                                 23
Contact No                0333-4567890
Name: 2, dtype: object

In [25]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [26]:
df.columns

Index(['Name', 'Email', 'Age', 'Contact No'], dtype='object')

In [28]:
array=df.to_numpy

In [29]:
print(array)

<bound method DataFrame.to_numpy of            Name                     Email  Age    Contact No
0   Ayesha Khan     ayesha.khan@gmail.com   22  0301-1234567
1    Fatima Ali      fatima.ali@gmail.com   25  0322-9876543
2  Zainab Ahmed  zainab.ahmed@hotmail.com   23  0333-4567890
3    Hira Saeed      hira.saeed@gmail.com   24  0345-6789012
4   Mariam Raza   mariam.raza@outlook.com   26  0312-7890123>

In [30]:
print(df)

           Name                     Email  Age    Contact No
0   Ayesha Khan     ayesha.khan@gmail.com   22  0301-1234567
1    Fatima Ali      fatima.ali@gmail.com   25  0322-9876543
2  Zainab Ahmed  zainab.ahmed@hotmail.com   23  0333-4567890
3    Hira Saeed      hira.saeed@gmail.com   24  0345-6789012
4   Mariam Raza   mariam.raza@outlook.com   26  0312-7890123

In [31]:
df.T

,0,1,2,3,4
Name,Ayesha Khan,Fatima Ali,Zainab Ahmed,Hira Saeed,Mariam Raza
Email,ayesha.khan@gmail.com,fatima.ali@gmail.com,zainab.ahmed@hotmail.com,hira.saeed@gmail.com,mariam.raza@outlook.com
Age,22,25,23,24,26
Contact No,0301-1234567,0322-9876543,0333-4567890,0345-6789012,0312-7890123

In [33]:
df.sort_index(axis=1, ascending=False)

           Name                     Email    Contact No  Age
0   Ayesha Khan     ayesha.khan@gmail.com  0301-1234567   22
1    Fatima Ali      fatima.ali@gmail.com  0322-9876543   25
2  Zainab Ahmed  zainab.ahmed@hotmail.com  0333-4567890   23
3    Hira Saeed      hira.saeed@gmail.com  0345-6789012   24
4   Mariam Raza   mariam.raza@outlook.com  0312-7890123   26

In [34]:
df.sort_values(by="Age")

           Name                     Email  Age    Contact No
0   Ayesha Khan     ayesha.khan@gmail.com   22  0301-1234567
2  Zainab Ahmed  zainab.ahmed@hotmail.com   23  0333-4567890
3    Hira Saeed      hira.saeed@gmail.com   24  0345-6789012
1    Fatima Ali      fatima.ali@gmail.com   25  0322-9876543
4   Mariam Raza   mariam.raza@outlook.com   26  0312-7890123

In [35]:
df["Name"]

0     Ayesha Khan
1      Fatima Ali
2    Zainab Ahmed
3      Hira Saeed
4     Mariam Raza
Name: Name, dtype: object

In [36]:
df[0:3]

           Name                     Email  Age    Contact No
0   Ayesha Khan     ayesha.khan@gmail.com   22  0301-1234567
1    Fatima Ali      fatima.ali@gmail.com   25  0322-9876543
2  Zainab Ahmed  zainab.ahmed@hotmail.com   23  0333-4567890

In [39]:
df.loc[:, ["Name", "Age"]]

           Name  Age
0   Ayesha Khan   22
1    Fatima Ali   25
2  Zainab Ahmed   23
3    Hira Saeed   24
4   Mariam Raza   26

In [40]:
df.loc[:]

           Name                     Email  Age    Contact No
0   Ayesha Khan     ayesha.khan@gmail.com   22  0301-1234567
1    Fatima Ali      fatima.ali@gmail.com   25  0322-9876543
2  Zainab Ahmed  zainab.ahmed@hotmail.com   23  0333-4567890
3    Hira Saeed      hira.saeed@gmail.com   24  0345-6789012
4   Mariam Raza   mariam.raza@outlook.com   26  0312-7890123

In [42]:
dates = pd.date_range("20250206", periods=6)

In [43]:
print(dates)

DatetimeIndex(['2025-02-06', '2025-02-07', '2025-02-08', '2025-02-09',
               '2025-02-10', '2025-02-11'],
              dtype='datetime64[ns]', freq='D')

In [44]:
df.loc["20250207":"20250209", ["Name", "Age"]]

Empty DataFrame
Columns: [Name, Age]
Index: []

In [46]:
# Selecting a single value using .loc[]
value = df.loc[1, "Name"]  # Get the value at row index 1 and column "Name"

print(value)

Fatima Ali

In [48]:
df.iloc[3]

Name                    Hira Saeed
Email         hira.saeed@gmail.com
Age                             24
Contact No            0345-6789012
Name: 3, dtype: object

In [50]:
df.iloc[1:4, 0:2]

           Name                     Email
1    Fatima Ali      fatima.ali@gmail.com
2  Zainab Ahmed  zainab.ahmed@hotmail.com
3    Hira Saeed      hira.saeed@gmail.com

In [51]:
df.iloc[[1, 2, 4], [0, 2]]

           Name  Age
1    Fatima Ali   25
2  Zainab Ahmed   23
4   Mariam Raza   26

In [52]:
df.iloc[1:3, :]

           Name                     Email  Age    Contact No
1    Fatima Ali      fatima.ali@gmail.com   25  0322-9876543
2  Zainab Ahmed  zainab.ahmed@hotmail.com   23  0333-4567890

In [53]:
df.iloc[:, 1:3]

                      Email  Age
0     ayesha.khan@gmail.com   22
1      fatima.ali@gmail.com   25
2  zainab.ahmed@hotmail.com   23
3      hira.saeed@gmail.com   24
4   mariam.raza@outlook.com   26

In [54]:
df.iloc[1, 1]

'fatima.ali@gmail.com'

In [55]:
df.iat[1, 1]

'fatima.ali@gmail.com'

In [58]:
df[df["Age"] >= 25]

          Name                    Email  Age    Contact No
1   Fatima Ali     fatima.ali@gmail.com   25  0322-9876543
4  Mariam Raza  mariam.raza@outlook.com   26  0312-7890123

In [60]:
df2 = df.copy()

In [63]:
print(df2)

           Name                     Email  Age    Contact No
0   Ayesha Khan     ayesha.khan@gmail.com   22  0301-1234567
1    Fatima Ali      fatima.ali@gmail.com   25  0322-9876543
2  Zainab Ahmed  zainab.ahmed@hotmail.com   23  0333-4567890
3    Hira Saeed      hira.saeed@gmail.com   24  0345-6789012
4   Mariam Raza   mariam.raza@outlook.com   26  0312-7890123

In [65]:
print(df2.shape[0])

5

In [66]:
# Adding a new column 'E'
df2["E"] = ["one", "one", "two", "three", "four"]

# Printing the updated DataFrame
print(df2)

           Name                     Email  Age    Contact No      E
0   Ayesha Khan     ayesha.khan@gmail.com   22  0301-1234567    one
1    Fatima Ali      fatima.ali@gmail.com   25  0322-9876543    one
2  Zainab Ahmed  zainab.ahmed@hotmail.com   23  0333-4567890    two
3    Hira Saeed      hira.saeed@gmail.com   24  0345-6789012  three
4   Mariam Raza   mariam.raza@outlook.com   26  0312-7890123   four

In [68]:
#to check specific entry in dataframe
df2[df2["E"].isin(["two", "four"])]

           Name                     Email  Age    Contact No     E
2  Zainab Ahmed  zainab.ahmed@hotmail.com   23  0333-4567890   two
4   Mariam Raza   mariam.raza@outlook.com   26  0312-7890123  four

In [69]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))

In [70]:
print(s1)

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [71]:
# Updating the first row's "Age" column to 0
df.at[df.index[0], "Age"] = 0

print("\nAfter update:")
print(df)

After update:
           Name                     Email  Age    Contact No
0   Ayesha Khan     ayesha.khan@gmail.com    0  0301-1234567
1    Fatima Ali      fatima.ali@gmail.com   25  0322-9876543
2  Zainab Ahmed  zainab.ahmed@hotmail.com   23  0333-4567890
3    Hira Saeed      hira.saeed@gmail.com   24  0345-6789012
4   Mariam Raza   mariam.raza@outlook.com   26  0312-7890123

In [72]:
#Setting values by position:
df.iat[0, 1] = 0

In [73]:
df

           Name                     Email  Age    Contact No
0   Ayesha Khan                         0    0  0301-1234567
1    Fatima Ali      fatima.ali@gmail.com   25  0322-9876543
2  Zainab Ahmed  zainab.ahmed@hotmail.com   23  0333-4567890
3    Hira Saeed      hira.saeed@gmail.com   24  0345-6789012
4   Mariam Raza   mariam.raza@outlook.com   26  0312-7890123

In [76]:
%pip install numpy

Requirement already satisfied: numpy in c:\users\hp\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (2.2.4)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 25.0.1
[notice] To update, run: C:\Users\HP\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.11_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

In [7]:
import numpy as np

In [78]:
# Updating all values in the 'Age' column to 5
df.loc[:, "Age"] = np.array([5] * len(df))

print("\nAfter update:")
print(df)

After update:
           Name                     Email  Age    Contact No
0   Ayesha Khan                         0    5  0301-1234567
1    Fatima Ali      fatima.ali@gmail.com    5  0322-9876543
2  Zainab Ahmed  zainab.ahmed@hotmail.com    5  0333-4567890
3    Hira Saeed      hira.saeed@gmail.com    5  0345-6789012
4   Mariam Raza   mariam.raza@outlook.com    5  0312-7890123

In [79]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])
df1.loc[dates[0] : dates[1], "E"] = 1
df1

           Name Email  Age Contact No    E
2025-02-06  NaN   NaN  NaN        NaN  1.0
2025-02-07  NaN   NaN  NaN        NaN  1.0
2025-02-08  NaN   NaN  NaN        NaN  NaN
2025-02-09  NaN   NaN  NaN        NaN  NaN

In [84]:
df1.dropna(how="any")

Empty DataFrame
Columns: [Name, Email, Age, Contact No, E]
Index: []

In [85]:
df1

           Name Email  Age Contact No    E
2025-02-06  NaN   NaN  NaN        NaN  1.0
2025-02-07  NaN   NaN  NaN        NaN  1.0
2025-02-08  NaN   NaN  NaN        NaN  NaN
2025-02-09  NaN   NaN  NaN        NaN  NaN

In [86]:
df1.fillna(value=5)

C:\Users\HP\AppData\Local\Temp\ipykernel_8764\3537041387.py:1: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df1.fillna(value=5)

            Name  Email  Age  Contact No    E
2025-02-06     5      5  5.0           5  1.0
2025-02-07     5      5  5.0           5  1.0
2025-02-08     5      5  5.0           5  5.0
2025-02-09     5      5  5.0           5  5.0

In [87]:
df1

           Name Email  Age Contact No    E
2025-02-06  NaN   NaN  NaN        NaN  1.0
2025-02-07  NaN   NaN  NaN        NaN  1.0
2025-02-08  NaN   NaN  NaN        NaN  NaN
2025-02-09  NaN   NaN  NaN        NaN  NaN

In [88]:
pd.isna(df1)

            Name  Email   Age  Contact No      E
2025-02-06  True   True  True        True  False
2025-02-07  True   True  True        True  False
2025-02-08  True   True  True        True   True
2025-02-09  True   True  True        True   True

In [90]:
df1.mean()

Name          NaN
Email         NaN
Age           NaN
Contact No    NaN
E             1.0
dtype: object

In [91]:
df

           Name                     Email  Age    Contact No
0   Ayesha Khan                         0    5  0301-1234567
1    Fatima Ali      fatima.ali@gmail.com    5  0322-9876543
2  Zainab Ahmed  zainab.ahmed@hotmail.com    5  0333-4567890
3    Hira Saeed      hira.saeed@gmail.com    5  0345-6789012
4   Mariam Raza   mariam.raza@outlook.com    5  0312-7890123

In [92]:
df['Age'].mean()

np.float64(5.0)

In [96]:
df1.mean(axis=1)

2025-02-06    1.0
2025-02-07    1.0
2025-02-08    NaN
2025-02-09    NaN
Freq: D, dtype: object

In [97]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)

In [98]:
print(s)

2025-02-06    NaN
2025-02-07    NaN
2025-02-08    1.0
2025-02-09    3.0
2025-02-10    5.0
2025-02-11    NaN
Freq: D, dtype: float64

In [14]:
df.dtypes

Name          object
Email         object
Age            int64
Contact No    object
dtype: object

In [13]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [12]:
df.columns

Index(['Name', 'Email', 'Age', 'Contact No'], dtype='object')

In [15]:
df.to_numpy

<bound method DataFrame.to_numpy of            Name                     Email  Age    Contact No
0   Ayesha Khan     ayesha.khan@gmail.com   22  0301-1234567
1    Fatima Ali      fatima.ali@gmail.com   25  0322-9876543
2  Zainab Ahmed  zainab.ahmed@hotmail.com   23  0333-4567890
3    Hira Saeed      hira.saeed@gmail.com   24  0345-6789012
4   Mariam Raza   mariam.raza@outlook.com   26  0312-7890123>

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        5 non-null      object
 1   Email       5 non-null      object
 2   Age         5 non-null      int64
 3   Contact No  5 non-null      object
dtypes: int64(1), object(3)
memory usage: 292.0+ bytes

In [17]:
df.describe()

             Age
count   5.000000
mean   24.000000
std     1.581139
min    22.000000
25%    23.000000
50%    24.000000
75%    25.000000
max    26.000000

In [18]:
df["Age"]

0    22
1    25
2    23
3    24
4    26
Name: Age, dtype: int64

In [19]:
df[0:2]

          Name                  Email  Age    Contact No
0  Ayesha Khan  ayesha.khan@gmail.com   22  0301-1234567
1   Fatima Ali   fatima.ali@gmail.com   25  0322-9876543

In [20]:
df2=df.copy()

In [22]:
df["Age"].mean()

np.float64(24.0)

In [23]:
df.mode()

           Name                     Email  Age    Contact No
0   Ayesha Khan     ayesha.khan@gmail.com   22  0301-1234567
1    Fatima Ali      fatima.ali@gmail.com   23  0312-7890123
2    Hira Saeed      hira.saeed@gmail.com   24  0322-9876543
3   Mariam Raza   mariam.raza@outlook.com   25  0333-4567890
4  Zainab Ahmed  zainab.ahmed@hotmail.com   26  0345-6789012

In [8]:
#make series
s= pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
s.str.lower()
print(s)

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [ ]:
df1 = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)